Revit 2024 API
BuiltInFailures.FamilyFailures.ReferencePlanesOverconstrained Property
 Reference Planes are overconstrained.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ReferencePlanesOverconstrained { get; }
Visual Basic
Public Shared ReadOnly Property ReferencePlanesOverconstrained As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ReferencePlanesOverconstrained {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace